// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
console.log("***-- Перевірка, до якої четверті години попадає число --***")
document.write('<hr/><b> Перевірка, до якої четверті години попадає число </b><br/> ')

let time = +prompt('Введіть число 0 до 59, щоб дізнатись до якої чверті години попадає число  ',);
if (time >= 0 && time <= 14 ) {
    console.log(`Перша чверть години`)
    document.write(`Перша чверть години`)
} else if (time >= 15 && time <= 29  ) {
    console.log(`Друга чверть години`)
    document.write(`Друга чверть години`)
} else if (time >= 30 && time <= 44 ) {
    console.log(`Третя чверть години`)
    document.write(`Третя чверть години`)
} else if (time >= 45 && time <= 59) {
    console.log(`Четверта чверть години`)
    document.write(`Четверта чверть години`)
} else  {
    console.log(`Не коректно введені дані`)
    document.write(`Не коректно введені дані`)
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).
console.log("***-- Перевірка, до якої декади місяця попадає число --***")
document.write('<hr/><b> Перевірка, до якої декади місяця попадає число </b><br/> ')

let day = +prompt('Введить число місяця 1 до 30, щоб дізнатись до якої декади місяця попадає число ',);
if (day >= 1 && day <= 10 ) {
    console.log(`Перша декада місяця`)
    document.write(`Перша декада місяця`)
} else if (day >= 11 && day <= 20 ) {
    console.log(`Друга декада місяця`)
    document.write(`Друга декада місяця`)
} else if (day >=  21 && day <= 31 ) {
    console.log(`Третя декада місяця`)
    document.write(`декада місяця`)
} else  {
    console.log(`Не коректно введені дані`)
    document.write(`Не коректно введені дані`)
}
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
console.log("***-- - У нас є змінна test не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно' --***")
document.write('<hr/><b>- У нас є змінна test не дорівнює true, виведіть "Вірно", інакше виведіть "Неправильно" </b><br/> ')

let test = false;

if (!test ) {
    console.log('Вірно');
    document.write(`Вірно`)
} else {
    console.log('Неправильно');
    document.write(`Неправильно`)
}
(!test) ? console.log('Вірно') : console.log('Неправильно')

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
console.log("***-- змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно' --***")
document.write("<hr/><b>- змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'  </b><br/> ")
let a = +prompt('Введить число');
if (a !== 0) {
    console.log('Вірно');
    document.write('Вірно');
} else {
    console.log('Неправильно');
    document.write('Неправильно');
}

(a !== 0) ? console.log('Вірно') : console.log('Неправильно')

// - Скласти розклад на тиждень за домопоги switch.
//   Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
console.log("***-- Скласти розклад на тиждень за домопоги switch --***")
document.write("<hr/><b>- Скласти розклад на тиждень за домопоги switch </b><br/> ")

let week = +prompt('Введить порядковий номер дня тижня', '');

switch (week) {
    case 1:
        console.log('Виконую домашнє завдання');
        document.write('Виконую домашнє завдання')
        break;
    case 2:
        console.log('Виконую классну роботу');
        document.write('Виконую классну роботу')
        break;
    case 3:
        console.log('Виконую додаткові завдання');
        document.write('Виконую додаткові завдання')
        break;
    case 4:
        console.log('Вивчаю анлійську мову');
        document.write('Вивчаю анлійську мову')
        break;
    case 5:
        console.log('Закріплюю вивчене');
        document.write('Закріплюю вивчене');
        break;
    case 6:
        console.log('Займаюся побутовими справами');
        document.write('Займаюся побутовими справами');
        break;
    case 7:
        console.log('День відпочинку та розваг');
        document.write('День відпочинку та розваг');
        break;
    default:
        console.log('Такого дня тиждня не існує');
        document.write('Такого дня тиждня не існує');
}

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

console.log("***-- Потрібно визначити Високосний рік чи ні. --***")
document.write("<hr/><b>-Потрібно визначити Високосний рік чи ні. </b><br/> ")

let leapYear = +prompt('Введить рік', '');
if (leapYear % 4===0) {
    console.log('Високосний рік');
    document.write('Високосний рік')
} else {
    console.log('Не високосний рік');
    document.write('Не високосний рік')
}

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

console.log("***-- напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript? --***")
document.write("<hr/><b>- напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript? </b><br/> ")

let question = prompt('Введить рік', 'ECMAScript');

if (question ==='ECMAScript') {
    console.log('Правильно!');
    document.write('Правильно!');
} else {
    console.log('Не знаєте? ECMAScript!');
    document.write('Не знаєте? ECMAScript!');
}
